contrib-imola/cics-bc/jbi4cics/src/test/resources/xmlmessages/testVinciMessage2.xml

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:m0="http://math.java">
	<SOAP-ENV:Body>
		<m:provaVinciOperation xmlns:m="http://generators.utils.webservices.test.jbi4cics.imolinfo.it">
			<m:in0>
				<m:inputString>Hello World</m:inputString>
			</m:in0>
		</m:provaVinciOperation>
	</SOAP-ENV:Body>
</SOAP-ENV:Envelope>
